demo-output/website/campaign/F9_work/steady_beta_55deg/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0 0 -0)
    (0 0.0094112825 -0.00041090547)
    (0 0.0094112825 0.00041090547)
    (0 0.011489055 -0.00050162295)
    (0 0.011489055 0.00050162295)
    (0.115 0 -0)
    (0.115 0.0094112825 -0.00041090547)
    (0.115 0.0094112825 0.00041090547)
    (0.115 0.011489055 -0.00050162295)
    (0.115 0.011489055 0.00050162295)
    (0.1173 0 -0)
    (0.1173 0.0094112825 -0.00041090547)
    (0.1173 0.0094112825 0.00041090547)
    (0.1173 0.011489055 -0.00050162295)
    (0.1173 0.011489055 0.00050162295)
    (0.3013 0 -0)
    (0.3013 0.0094112825 -0.00041090547)
    (0.3013 0.0094112825 0.00041090547)
    (0.3013 0.011489055 -0.00050162295)
    (0.3013 0.011489055 0.00050162295)
);

blocks
(
    hex (0 5 6 1 0 5 7 2) (60 24 1) simpleGrading (1 1.6 1)
    hex (1 6 8 3 2 7 9 4) (60 8 1) simpleGrading (1 6 1)
    hex (5 10 11 6 5 10 12 7) (6 24 1) simpleGrading (1 1.6 1)
    hex (10 15 16 11 10 15 17 12) (90 24 1) simpleGrading (0.25 1.6 1)
    hex (11 16 18 13 12 17 19 14) (90 8 1) simpleGrading (0.25 6 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 0)
            (1 3 4 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (15 15 17 16)
            (16 17 19 18)
        );
    }
    pipeWall
    {
        type wall;
        faces
        (
            (3 8 9 4)
            (13 18 19 14)
        );
    }
    plate
    {
        type wall;
        faces
        (
            (6 11 12 7)
            (6 8 9 7)
            (11 12 14 13)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 5 5 0)
            (5 10 10 5)
            (10 15 15 10)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 5 6 1)
            (1 6 8 3)
            (5 10 11 6)
            (10 15 16 11)
            (11 16 18 13)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 2 7 5)
            (2 4 9 7)
            (5 7 12 10)
            (10 12 17 15)
            (12 14 19 17)
        );
    }
);

mergePatchPairs
(
);
